In [6]:
#LOAD CLIENT DATA FROM SQL FILE
import pandas as pd
import sqlite3

In [7]:
#file.sql change > sqlite3 file.db
# terminal cat client_zoo.sql | sqlite3 clientzoo.db

from sqlalchemy import create_engine

file_db='datasets/clientzoo.db'

engine=create_engine("sqlite:///{}".format(file_db))
sql='SELECT * from client_zoo'

order_data=pd.read_sql(sql,engine)
order_data

,id,first_name,last_name,location,cat,dog,other,frequency,sum_order
0,1,Betteann,Semaine,Czech Republic,0,1,1,week,2924.02
1,2,Marjorie,Seamon,None,0,1,0,week,3548.38
2,3,Filbert,Napoli,Poland,1,0,0,month,3114.94
3,4,Helenka,Yaakov,Poland,1,0,0,week,1412.04
4,5,Neel,Joselevitz,Czech Republic,0,0,1,quarter,5326.35
...,...,...,...,...,...,...,...,...,...
495,496,Dael,Maylam,Poland,0,0,1,year,1799.72
496,497,Nonnah,Habens,None,0,1,0,year,2629.06
497,498,Derward,Sandeford,Poland,None,None,None,year,3559.92
498,499,Claudianus,Abelevitz,Germany,None,None,None,month,145.19
499,500,Colan,Goodey,Poland,1,0,0,month,3293.49

In [11]:
# BASIC overall INFO -SUMA zamówienia 
order_data.sum_order.describe()

count     482.000000
mean     2881.633610
std      1753.071301
min        10.990000
25%      1318.520000
50%      2884.630000
75%      4373.762500
max      5988.540000
Name: sum_order, dtype: float64

In [19]:
#PREPARING DATA 
#cleaning DATA 

#ile jest NaN 
order_data.last_name.isna   #sprawdzenie jakie dane Missing/Nan/Null/Braki

<bound method Series.isna of 0         Semaine
2          Napoli
3          Yaakov
4      Joselevitz
6           Leere
          ...
483      Elletson
485     Dollimore
493          Held
495        Maylam
499        Goodey
Name: last_name, Length: 281, dtype: object>

In [15]:
#PREPARING DATA 
#cleaning DATA 
#>>MISSING INFO -drop rows with missing info

order_data=order_data.dropna()
order_data
#z 500 klientów wybrakowane dane z pozostało 281 klientów

,id,first_name,last_name,location,cat,dog,other,frequency,sum_order
0,1,Betteann,Semaine,Czech Republic,0,1,1,week,2924.02
2,3,Filbert,Napoli,Poland,1,0,0,month,3114.94
3,4,Helenka,Yaakov,Poland,1,0,0,week,1412.04
4,5,Neel,Joselevitz,Czech Republic,0,0,1,quarter,5326.35
6,7,Celinka,Leere,Poland,1,1,0,week,200.02
...,...,...,...,...,...,...,...,...,...
483,484,Latia,Elletson,Poland,1,0,1,quarter,328.61
485,486,Birk,Dollimore,Czech Republic,0,0,0,week,3739.64
493,494,Lethia,Held,Czech Republic,0,0,0,year,754.38
495,496,Dael,Maylam,Poland,0,0,1,year,1799.72
499,500,Colan,Goodey,Poland,1,0,0,month,3293.49

In [25]:
#>>check duplicated data 
order_data.duplicated()  #nie ma powtarzajacych się wpisów

0      False
2      False
3      False
4      False
6      False
       ...
483    False
485    False
493    False
495    False
499    False
Length: 281, dtype: bool

In [31]:
#ORGANIZING DATA  SORTING 
order_data.sort_values(by=['sum_order','frequency']) #min sum_order 19.11 a max 5988.54

,id,first_name,last_name,location,cat,dog,other,frequency,sum_order
124,125,Sharline,Sonier,Czech Republic,0,0,1,year,19.11
61,62,Dar,Sueter,Poland,0,1,1,year,22.37
89,90,Zelda,Woolfitt,Poland,1,0,0,month,32.83
252,253,Manda,Volkes,Germany,1,1,1,quarter,78.12
332,333,Aguie,Pingstone,Poland,1,0,1,month,86.81
...,...,...,...,...,...,...,...,...,...
292,293,Lusa,Danskine,Czech Republic,0,0,0,week,5868.36
460,461,Saxon,Chattelaine,Poland,1,0,0,week,5920.96
278,279,Petronille,Lilbourne,Poland,0,0,1,month,5927.22
48,49,Celka,Stanner,Czech Republic,0,0,0,quarter,5947.87
354,355,Meryl,Ladewig,Czech Republic,1,0,1,month,5988.54

In [36]:
#AGGREGATE SORTING
# example Sum of Order - Location Origin State

pd.pivot_table(order_data,values=['sum_order'], index=['location'])

                  sum_order
location
Austria         4202.705000
Czech Republic  3092.917590
Germany         3180.742857
Poland          2752.790879

In [42]:
df_freq=order_data.loc[order_data['frequency']=="week"]
pd.pivot_table(df_freq,index=['location'],aggfunc='max',values=['sum_order'])

                sum_order
location
Czech Republic    5868.36
Germany           5489.46
Poland            5920.96